In [93]:
import pandas as pd
import numpy as np

s = pd.Series([85,95,90], index = ['Korean','Math','English'])
s.index
s.values
s.dtype

dtype('int64')

In [94]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Seoul', 'Busan', 'Incheon']
}

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon

In [95]:
data = {"Student": ["Tom", "Jane", "Mike"],
"Score": [87, 92, 78],
"Passed": [True, True, False]
}

df = pd.DataFrame(data)
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [96]:
df.columns

Index(['Student', 'Score', 'Passed'], dtype='object')

In [97]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  3 non-null      object
 1   Score    3 non-null      int64
 2   Passed   3 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 183.0+ bytes

In [99]:
df.describe()

           Score
count   3.000000
mean   85.666667
std     7.094599
min    78.000000
25%    82.500000
50%    87.000000
75%    89.500000
max    92.000000

In [100]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [101]:
df["Score"]
df[["Student","Passed"]]
df.loc[0]
df.iloc[2]

Student     Mike
Score         78
Passed     False
Name: 2, dtype: object

In [102]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [103]:
df[df["Score"] >= 90]

  Student  Score  Passed
1    Jane     92    True

In [104]:
df[df['Passed'] != True]

  Student  Score  Passed
2    Mike     78   False

In [105]:
df[ (df["Score"] >= 85) & (df['Passed'] == True)]

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True

In [106]:
df[df["Student"] == "Jane"]

  Student  Score  Passed
1    Jane     92    True

In [107]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [108]:
df.sort_values("Score")
df.sort_values("Score",ascending = False)
df.sort_values(by=["Passed","Score"])
df.sort_index()

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [109]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [110]:
df["Grade"] = ["B", "A", "C"]
df
# df["score2"] = df["Score"] + 5
# df.loc[3] = ["Sara", 88, True, "B", 93]

  Student  Score  Passed Grade
0     Tom     87    True     B
1    Jane     92    True     A
2    Mike     78   False     C

In [111]:
df["score2"] = df["Score"] + 5
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83

In [112]:
df.loc[3] = ["Sara", 88, True, "B", 93]
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83
3    Sara     88    True     B      93

In [113]:
df.drop(3, axis = 0, inplace=True)
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83

In [114]:
import numpy as np

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Score": [85, np.nan, 78, np.nan],
    "Passed": [True, True, False, np.nan]
})
df

      Name  Score Passed
0    Alice   85.0   True
1      Bob    NaN   True
2  Charlie   78.0  False
3    David    NaN    NaN

In [115]:
df.isnull()

    Name  Score  Passed
0  False  False   False
1  False   True   False
2  False  False   False
3  False   True    True

In [116]:
df.isnull().sum()

Name      0
Score     2
Passed    1
dtype: int64

In [117]:
df.dropna()

      Name  Score Passed
0    Alice   85.0   True
2  Charlie   78.0  False

In [118]:
df.dropna(axis=1)

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [119]:
df.fillna(0)

      Name  Score Passed
0    Alice   85.0   True
1      Bob    0.0   True
2  Charlie   78.0  False
3    David    0.0      0

In [120]:
df["Score"].fillna(df["Score"].mean())

0    85.0
1    81.5
2    78.0
3    81.5
Name: Score, dtype: float64

In [121]:
df["Passed"].fillna(method="ffill")

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2636\1230094823.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Passed"].fillna(method="ffill")
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2636\1230094823.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["Passed"].fillna(method="ffill")

0     True
1     True
2    False
3    False
Name: Passed, dtype: bool

In [122]:
df["Passed"].fillna(method="bfill")

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2636\2840239724.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Passed"].fillna(method="bfill")

0     True
1     True
2    False
3      NaN
Name: Passed, dtype: object

In [123]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Score": [85, np.nan, 78, np.nan],
    "Passed": [True, True, False, np.nan]
})
df

      Name  Score Passed
0    Alice   85.0   True
1      Bob    NaN   True
2  Charlie   78.0  False
3    David    NaN    NaN

In [124]:
df.isnull()

    Name  Score  Passed
0  False  False   False
1  False   True   False
2  False  False   False
3  False   True    True

In [125]:
df.isnull().sum()

Name      0
Score     2
Passed    1
dtype: int64

In [126]:
df.dropna()

      Name  Score Passed
0    Alice   85.0   True
2  Charlie   78.0  False

In [127]:
df["Score"].fillna(df["Score"].mean())

0    85.0
1    81.5
2    78.0
3    81.5
Name: Score, dtype: float64

In [128]:
df["Passed"].fillna(method = "ffill")

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2636\2610582112.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Passed"].fillna(method = "ffill")
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2636\2610582112.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["Passed"].fillna(method = "ffill")

0     True
1     True
2    False
3    False
Name: Passed, dtype: bool

In [129]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Score": [85.0, 81.5, 78.0, 81.5],
    "Passed": [True, True, False, False]
})
df

      Name  Score  Passed
0    Alice   85.0    True
1      Bob   81.5    True
2  Charlie   78.0   False
3    David   81.5   False

In [130]:
df["Score"].mean()
df["Score"].max()
df["Score"].std()
df["Passed"].sum()
df.describe()

           Score
count   4.000000
mean   81.500000
std     2.857738
min    78.000000
25%    80.625000
50%    81.500000
75%    82.375000
max    85.000000

In [131]:
df

      Name  Score  Passed
0    Alice   85.0    True
1      Bob   81.5    True
2  Charlie   78.0   False
3    David   81.5   False

In [132]:
df.groupby("Passed")["Score"].mean()

Passed
False    79.75
True     83.25
Name: Score, dtype: float64

In [133]:
df.groupby("Passed")["Score"].agg(["mean", "max", "count"])

         mean   max  count
Passed
False   79.75  81.5      2
True    83.25  85.0      2

In [134]:
df.groupby("Passed")[["Score"]].mean()

        Score
Passed
False   79.75
True    83.25

In [135]:
df

      Name  Score  Passed
0    Alice   85.0    True
1      Bob   81.5    True
2  Charlie   78.0   False
3    David   81.5   False

In [136]:
df.groupby("Passed")[["Score"]].mean()

        Score
Passed
False   79.75
True    83.25

In [137]:
df.groupby("Passed")[["Score"]].agg(["mean",'max','count'])

        Score
         mean   max count
Passed
False   79.75  81.5     2
True    83.25  85.0     2

In [138]:
df.groupby("Passed").describe()

       Score
       count   mean       std   min     25%    50%     75%   max
Passed
False    2.0  79.75  2.474874  78.0  78.875  79.75  80.625  81.5
True     2.0  83.25  2.474874  81.5  82.375  83.25  84.125  85.0

In [139]:
df1 = pd.DataFrame({
    "ID": [1, 2],
    "Name": ["Tom", "Jane"]
})

df2 = pd.DataFrame({
    "ID": [1, 2],
    "Score": [87, 92]
})

print(df1)
print(df2)

   ID  Name
0   1   Tom
1   2  Jane
   ID  Score
0   1     87
1   2     92

In [140]:
df3 = pd.merge(df1,df2,on="ID")
df3

   ID  Name  Score
0   1   Tom     87
1   2  Jane     92

In [141]:
df4 = pd.concat([df1,df2], axis = 1)
df4

   ID  Name  ID  Score
0   1   Tom   1     87
1   2  Jane   2     92

# 종합 실습 문제 : 학생 성적 분석

In [142]:
import pandas as pd

# 학생 기본 정보
students = pd.DataFrame({
    "ID": [1, 2, 3, 4],
    "Name": ["Tom", "Jane", "Mike", "Lucy"]
})

# 시험 점수
scores = pd.DataFrame({
    "ID": [1, 2, 3, 4],
    "Score": [87, 92, 78, 85]
})

# 합격 여부
results = pd.DataFrame({
    "ID": [1, 2, 3, 4],
    "Passed": [True, True, False, True]
})

🧠 Step 2. 분석 단계
아래 작업들을 차례로 해보자:

students, scores, results를 ID 기준으로 하나의 DataFrame으로 병합해 df를 만드세요.

Score 기준으로 내림차순 정렬해서 상위 2명의 정보를 출력하세요.

평균 점수 이상인 학생만 필터링해서 출력하세요.

Score에 따라 등급(Grade)을 매기세요:

90 이상 → "A"

80 이상 → "B"

나머지 → "C"

Passed 여부에 따라 평균 점수와 인원 수를 구해보세요 (groupby 사용)

In [143]:
students

   ID  Name
0   1   Tom
1   2  Jane
2   3  Mike
3   4  Lucy

In [144]:
scores

   ID  Score
0   1     87
1   2     92
2   3     78
3   4     85

In [145]:
results

   ID  Passed
0   1    True
1   2    True
2   3   False
3   4    True

In [146]:
# students, scores, results를 ID 기준으로 하나의 DataFrame으로 병합해 df를 만드세요.

df = pd.merge(students, scores, on = "ID")

df = pd.merge(df,results, on ="ID")
df

   ID  Name  Score  Passed
0   1   Tom     87    True
1   2  Jane     92    True
2   3  Mike     78   False
3   4  Lucy     85    True

In [147]:
#Score 기준으로 내림차순 정렬해서 상위 2명의 정보를 출력하세요.
df1 = df.sort_values("Score",ascending = False)
df1
df1.reset_index().drop("index",axis=1)
df1[df1.index < 2]

   ID  Name  Score  Passed
1   2  Jane     92    True
0   1   Tom     87    True

In [148]:
# 평균 점수 이상인 학생만 필터링해서 출력하세요.
mean = df["Score"].mean()
df[df["Score"] >= mean]

   ID  Name  Score  Passed
0   1   Tom     87    True
1   2  Jane     92    True

In [149]:
df["Grade"] = None
df

   ID  Name  Score  Passed Grade
0   1   Tom     87    True  None
1   2  Jane     92    True  None
2   3  Mike     78   False  None
3   4  Lucy     85    True  None

In [156]:
# df.loc[df["Score"] >= 90,"Grade"] = "A"
# df["Grade"]

In [ ]:
# Score에 따라 등급(Grade)을 매기세요:

# 90 이상 → "A"

# 80 이상 → "B"

# 나머지 → "C"

df.loc[(df["Score"] >= 90), "Grade"] = "A"
df.loc[( (df["Score"] >= 80) & (df["Score"] < 90 )), "Grade"] = "B"
df.loc[(df["Score"] < 80), "Grade"] = "C"
df

   ID  Name  Score  Passed Grade
0   1   Tom     87    True     B
1   2  Jane     92    True     A
2   3  Mike     78   False     C
3   4  Lucy     85    True     B

In [160]:
#Passed 여부에 따라 평균 점수와 인원 수를 구해보세요 (groupby 사용)
df

   ID  Name  Score  Passed Grade
0   1   Tom     87    True     B
1   2  Jane     92    True     A
2   3  Mike     78   False     C
3   4  Lucy     85    True     B

In [162]:
df.groupby("Passed")["Score"].agg(["mean",'count'])

        mean  count
Passed
False   78.0      1
True    88.0      3

In [5]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Tom", "Jane", "Mike", "Lucy"],
    "Score": [87, 92, 78, 85]
})
df["Grade"] = df["Score"].apply(
    lambda x: "A" if x >= 90 else "B" if x >= 80 else "C"
)
# df["Label"] = df.apply(
#     lambda row: f"{row['Name']} ({row['Grade']})", axis=1
# )
df

   Name  Score Grade
0   Tom     87     B
1  Jane     92     A
2  Mike     78     C
3  Lucy     85     B

In [6]:
df["Level"] = df["Score"].apply(
    lambda x : "Excellent" if x >= 95 else 'Good' if x >= 85 else 'Normal'
)

df

   Name  Score Grade   Level
0   Tom     87     B    Good
1  Jane     92     A    Good
2  Mike     78     C  Normal
3  Lucy     85     B    Good

In [7]:
df["label"] = df.apply(
    lambda row : f'{row['Name']} ({row['Grade']})', axis = 1
)
df

   Name  Score Grade   Level     label
0   Tom     87     B    Good   Tom (B)
1  Jane     92     A    Good  Jane (A)
2  Mike     78     C  Normal  Mike (C)
3  Lucy     85     B    Good  Lucy (B)

## 타이타닉 실습